cask_args appdir: "/Applications"
tap "go-delve/delve"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "mas"

mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835

cask "1Password"
cask "google-chrome"
cask "visual-studio-code"
cask "font-fira-code"

brew "asciinema"
brew "aspell"
brew "sqlite"
brew "openssl"
brew "chruby"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "doctl"
brew "git"
brew "gitlab-runner"
brew "gnupg"
brew "go"
brew "grpcurl"
brew "hub"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kustomize"
brew "markdown"
brew "mercurial"
brew "mysql"
brew "n"
brew "nginx"
brew "octant"
brew "packer"
brew "postgresql"
brew "protobuf-c"
brew "redis"
brew "ruby-install"
brew "shellcheck"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "vault"
brew "watch"
brew "wget"
brew "yamllint"
brew "zsh"
brew "zsh-completions"
